lvx/base/DataProcessors/бит_РабочееМестоКазначея.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<DataProcessor>
		<Properties>
			<Name>бит_РабочееМестоКазначея</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Компоновщик</Name>
					<Comment>Компоновщик</Comment>
					<Type>
						<v8:Type>dcsset:SettingsComposer</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомпоновщикАнализ</Name>
					<Comment>Компоновщик анализ</Comment>
					<Type>
						<v8:Type>dcsset:SettingsComposer</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимОтображенияПериодов</Name>
					<Comment>Режим отображения периодов</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимОтображенияСчетов</Name>
					<Comment>Режим отображения счетов</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперативныйДень</Name>
					<Comment>Оперативный день</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимСообщений</Name>
					<Comment>Режим сообщений</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УровеньРаскрытияСчетов</Name>
					<Comment>Уровень раскрытия дерева счетов по-умолчанию</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыделятьПредельныеСрокиПлатежа</Name>
					<Comment>Выделять предельные сроки платежа</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеФормироватьПлатежныеПоручения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет_Информация</Name>
					<Comment>Цвет информационных строк</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет_Прошлое</Name>
					<Comment>Цвет прошлое</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет_Настоящее</Name>
					<Comment>Цвет настоящее</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет_Будущее</Name>
					<Comment>Цвет будущее</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет_Запрет</Name>
					<Comment>Цвет запрет</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цвет_Выходной</Name>
					<Comment>Цвет выходной</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>7</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВысотаПанелиТекущийДокумент</Name>
					<Comment>Высота панели "Текущий документ"</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьОстаткиПоНеоплаченнымЗаявкам</Name>
					<Comment>Выводить остатки по неоплаченным заявкам</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьПрогнозыПлатежей</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Периодичность</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_кзн_ПериодичностьРМК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыделятьВыходныеДни</Name>
					<Comment>Выделять выходные дни</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьВыделенныеДокументыСумма</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьВыделенныеДокументыКоличество</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьВыделенныеДокументыМинимум</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьВыделенныеДокументыМаксимум</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьВыделенныеДокументыСреднее</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимОстатков</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_кзн_РежимОтображенияОстатковДС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимЗаписиРасчетыЧерезБанк</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_РежимыЗаписиДокумента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимЗаписиРасчетыЧерезКассу</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_РежимыЗаписиДокумента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Счета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидСчета</Name>
							<Comment>Вид счета</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Comment>Счет</Comment>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

lvx/base/InformationRegisters/бит_НеснижаемыеОстатки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_НеснижаемыеОстатки</Name>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетУчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lvx/base/AccumulationRegisters/ДенежныеСредстваНаличные.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредстваНаличные</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаУпр</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СуммаРегл</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АналитикаУчетаПоПартнерам</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.КлючиАналитикиУчетаПоПартнерам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаХозяйственнойОперации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиХозяйственныхОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФинЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбъектРасчетов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ОбъектыРасчетов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Касса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

lvx/base/AccumulationRegisters/бит_СведенияОбОстаткахДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>бит_СведенияОбОстаткахДенежныхСредств</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

lvx/base/Enums/бит_ВидыДанныхРабочееМестоКазначея.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_ВидыДанныхРабочееМестоКазначея</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДенежныйПоток</Name>
					<Comment>Денежный поток</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Расход</Name>
					<Comment>Расход</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Поступление</Name>
					<Comment>Поступление</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МНО</Name>
					<Comment>Неснижаемый остаток</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оплата</Name>
					<Comment>Оплачено</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прогноз</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

lvx/base/DataProcessors/бит_РабочееМестоКазначея/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - таблица команд печати 
//                   (состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати).
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
КонецПроцедуры

#КонецОбласти
	
#Область СлужебныйПрограммныйИнтерфейс

#Область ЗаполнениеОсновнойОбластиРМК

Функция НовыеПараметрыИзДанныхФормы() Экспорт

	ДанныеФормы = Новый Структура;
	ДанныеФормы.Вставить("ДеревоСчета", 		   Новый ДеревоЗначений);
	ДанныеФормы.Вставить("КолонкиПериодов", 	   Новый СписокЗначений);
	ДанныеФормы.Вставить("МаксУровеньДеревоСчета", 0);
	ДанныеФормы.Вставить("МаксКолвоДопАналитик",   0);
	
	Возврат ДанныеФормы;
	
КонецФункции

Функция НовыеПараметрыИзДанныхОбъекта() Экспорт

	ДанныеОбъекта = Новый Структура;
	ДанныеОбъекта.Вставить("НачалоПериода",			  	 '0001-01-01');
	ДанныеОбъекта.Вставить("КонецПериода", 				 '0001-01-01');
	ДанныеОбъекта.Вставить("ОперативныйДень",			 '0001-01-01');
	ДанныеОбъекта.Вставить("РежимОтображенияПериодов", 	 "");
	ДанныеОбъекта.Вставить("РежимОтображенияСчетов", 	 "");
	ДанныеОбъекта.Вставить("Счета", 					 Новый ТаблицаЗначений);
	ДанныеОбъекта.Вставить("РежимОстатков", 			 Перечисления.бит_кзн_РежимОтображенияОстатковДС.ПустаяСсылка());
	ДанныеОбъекта.Вставить("ВыводитьПрогнозыПлатежей", 	 Ложь);
	ДанныеОбъекта.Вставить("ПользовательскиеНастройки",  Новый ПользовательскиеНастройкиКомпоновкиДанных);
	ДанныеОбъекта.Вставить("Периодичность", 			 Перечисления.бит_кзн_ПериодичностьРМК.ПустаяСсылка());
	
	ДанныеОбъекта.Вставить("ВыводитьОстаткиПоНеоплаченнымЗаявкам", Ложь);

	Возврат ДанныеОбъекта;

КонецФункции

Функция ОбновитьДеревоСчетов(ДанныеФормы, ДанныеОбъекта) Экспорт

	КлючеваяОперация = НСтр("ru = 'Рабочее место казначея. Обновление дерева документов';
								|en = 'Financial Officer Workplace. Updating the Document tree'");
	ОписаниеЗамера = ОценкаПроизводительности.НачатьЗамерДлительнойОперации(КлючеваяОперация);
	
	ДеревоСчета 		   = ДанныеФормы.ДеревоСчета;
	КолонкиПериодов 	   = ДанныеФормы.КолонкиПериодов;
	МаксУровеньДеревоСчета = ДанныеФормы.МаксУровеньДеревоСчета;
	
	НачалоПериода = ДанныеОбъекта.НачалоПериода;
	КонецПериода  = ДанныеОбъекта.КонецПериода;
	СчетаУчета	  = ДанныеОбъекта.Счета;

	ДанныеФормы.ДеревоСчета.Строки.Очистить();
	ДанныеФормы.КолонкиПериодов.Очистить();
	ДанныеФормы.МаксУровеньДеревоСчета = 0;

	Если НЕ ЗначениеЗаполнено(НачалоПериода) 
	 ИЛИ НЕ ЗначениеЗаполнено(КонецПериода) 
	 ИЛИ (НачалоПериода > КонецПериода)Тогда
		
		ВызватьИсключение НСтр("ru='Настройка периода отображения данных выполнена не верно.';
							   |en='Setting the display data periroda made is not true.'");
	КонецЕсли;
	
	РезультатКомпоновкиРМК = РезультатКомпоновкиДанныхРМК(ДанныеОбъекта);
	Если РезультатКомпоновкиРМК.Строки.Количество() = 0 Тогда
		Возврат ДанныеФормы;	
	КонецЕсли;
	
	ПериодыКомпоновки = Новый ТаблицаЗначений(); 
	ПериодыКомпоновки.Колонки.Добавить("Период");
	
	МестоХраненияТип = Новый ОписаниеТипов("СправочникСсылка.БанковскиеСчетаОрганизаций, СправочникСсылка.Кассы");
	
	БанковскиеСчета = Новый ТаблицаЗначений(); 
	БанковскиеСчета.Колонки.Добавить("БанковскийСчет", МестоХраненияТип);
	БанковскиеСчета.Колонки.Добавить("Сумма", ОбщегоНазначения.ОписаниеТипаЧисло(15, 2));
	
	ЗаполнитьБанковскиеСчетаИПериоды(БанковскиеСчета, ПериодыКомпоновки, РезультатКомпоновкиРМК.Строки);
	ЗаполнитьКолонкиПериодов(ДанныеФормы.КолонкиПериодов, ПериодыКомпоновки, ДанныеОбъекта);
	ДобавитьКолонкиДерева(ДанныеФормы.ДеревоСчета, ДанныеФормы.КолонкиПериодов);
	
	ДанныеСчетов = ДанныеСчетов(БанковскиеСчета, ДанныеОбъекта, ДанныеФормы.КолонкиПериодов);
			
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоВалют") Тогда
		Если РезультатКомпоновкиРМК.Колонки.Найти("ВалютаДенежныхСредств") = Неопределено Тогда
			РезультатКомпоновкиРМК.Колонки.Добавить("ВалютаДенежныхСредств", ОбщегоНазначения.ОписаниеТипаСтрока(25));
		КонецЕсли;
	КонецЕсли;
	
	// Выведем дерево счетов 
	ОбойтиСтрокиДереваСчетов(РезультатКомпоновкиРМК, ДанныеФормы.ДеревоСчета.Строки, 
		Неопределено, ДанныеСчетов, ДанныеОбъекта, ДанныеФормы);

	ИмяШага = НСтр("ru = 'Завершение обновления'; en = 'Completing the update'");
	ОценкаПроизводительности.ЗакончитьЗамерДлительнойОперации(ОписаниеЗамера, 1, ИмяШага);
	
	Возврат ДанныеФормы;
	
КонецФункции

Функция ИмяКолонкиПериод(Префикс, ТекущийПериод) Экспорт
	
	// АПК:***-выкл Задан формат строковой переменной. Форматную строку не менять. 
	Возврат Префикс+"_"+Формат(ТекущийПериод,"ДФ=yyyyMMdd");

КонецФункции

#КонецОбласти // ЗаполнениеОсновнойОбластиРМК

Функция НовыеДанныеЗаполненияРеестраСтрокаТаблицы() Экспорт
	
	Таблица = Новый Структура; 
	Таблица.Вставить("ЗаявкаПлатежнаяПозиция");
	Таблица.Вставить("ПлатежнаяПозиция");
	Таблица.Вставить("ВалютаДенежныхСредств");
	Таблица.Вставить("ВидДенежныхСредств");
	Таблица.Вставить("БанковскийСчет");
	
	Возврат Таблица;

КонецФункции

Функция НовыеДанныеЗаполненияРеестра() Экспорт

	ДанныеЗаполнения = Новый Структура;
	
	ДанныеЗаполнения.Вставить("Таблица", Новый Массив());
	ДанныеЗаполнения.Вставить("ОперативныйДень", '0001-01-01');
	ДанныеЗаполнения.Вставить("Ответственный", Справочники.Пользователи.ПустаяСсылка());
	ДанныеЗаполнения.Вставить("РежимСообщений", "");
	
	Возврат ДанныеЗаполнения;

КонецФункции 

Функция НовыеПараметрыСоздатьРеестрыПлатежей() Экспорт

	Параметры = Новый Структура; 
	Параметры.Вставить("ДокументыПоОрганизациям", Новый Соответствие);
	Параметры.Вставить("ПроводитьРеестрыПлатежей", Ложь);

	Возврат Параметры;
	
КонецФункции
 
Процедура СоздатьРеестрыПлатежей(ПараметрыВыполнения, АдресВХранилище) Экспорт 
	
	ДокументыПоОрганизациям  = ПараметрыВыполнения.ДокументыПоОрганизациям;
	ПроводитьРеестрыПлатежей = ПараметрыВыполнения.ПроводитьРеестрыПлатежей;
	
	НовыеДокументы 		= Новый СписокЗначений; 
	ДобавленоДокументов = 0;
	Для каждого ДокументыОрганизации Из ДокументыПоОрганизациям Цикл
		РеестрПлатежей = СоздатьРеестрПлатежей(ДокументыОрганизации.Ключ, ДокументыОрганизации.Значение, ПроводитьРеестрыПлатежей);
		Если ЗначениеЗаполнено(РеестрПлатежей) Тогда
			НовыеДокументы.Добавить(РеестрПлатежей);
		КонецЕсли; 
	КонецЦикла;
	
	ДобавленоДокументов = НовыеДокументы.Количество();
	
	Результат = Новый Структура; 
	Результат.Вставить("Сообщения", ПолучитьСообщенияПользователю(Истина));
	Результат.Вставить("Выполнено", ДобавленоДокументов <> 0);
	Результат.Вставить("НовыеДокументы",НовыеДокументы);
	
	ПоместитьВоВременноеХранилище(Результат, АдресВХранилище); 
	
КонецПроцедуры
 
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЗаполнениеОсновнойОбластиРМК

Функция РезультатКомпоновкиДанныхРМК(ПараметрыРМК)
	
	ВыводитьОстаткиПоНеоплаченнымЗаявкам = ПараметрыРМК.ВыводитьОстаткиПоНеоплаченнымЗаявкам;
	ВыводитьПрогнозыПлатежей 			 = ПараметрыРМК.ВыводитьПрогнозыПлатежей;
	НачалоПериода						 = ПараметрыРМК.НачалоПериода;
	КонецПериода						 = КонецДня(ПараметрыРМК.КонецПериода);
	КонецПериодаГраница					 = КонецПериода + 1; 
	ПользовательскиеНастройки			 = ПараметрыРМК.ПользовательскиеНастройки;
	Периодичность						 = ПараметрыРМК.Периодичность;
	РежимОтображенияСчетов				 = ПараметрыРМК.РежимОтображенияСчетов;
	
	// Получим данные по настроенной СКД.
	СКД 			  = Обработки.бит_РабочееМестоКазначея.ПолучитьМакет("СхемаКомпоновкиДанных");
	КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных;
	
	// Удалим наборы, которые не будут использованы.
	ИменаНаборовКУдалению = Новый Массив;
	Если РежимОтображенияСчетов = "НеПустые" Тогда
		ИменаНаборовКУдалению.Добавить("БанковскиеСчета");
	КонецЕсли;
	Если НЕ ВыводитьОстаткиПоНеоплаченнымЗаявкам Тогда
		ИменаНаборовКУдалению.Добавить("ПланируемыйРасходОстатки");	
	КонецЕсли;
	Если НЕ ВыводитьПрогнозыПлатежей Тогда
		ИменаНаборовКУдалению.Добавить("ПрогнозПлатежа");
		ИменаНаборовКУдалению.Добавить("ПрогнозПоступления");
	КонецЕсли;

	Для каждого ИмяНабора Из ИменаНаборовКУдалению Цикл
		НаборДанных = СКД.НаборыДанных.Движения.Элементы.Найти(ИмяНабора);	
		Если НаборДанных <> Неопределено Тогда
			СКД.НаборыДанных.Движения.Элементы.Удалить(НаборДанных);
		Иначе
			// На случай переименования набора в схеме при внедрении и разработке.
			ТекстСообщения = НСтр("ru = 'Внутренняя ошибка: набор данных ""%1"" не найден.'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ИмяНабора);
			ВызватьИсключение ТекстСообщения;
		КонецЕсли;
	КонецЦикла;
	
	АдресХранилищаСКД = ПоместитьВоВременноеХранилище(СКД, Новый УникальныйИдентификатор);
	ИсточникНастроек  = Новый ИсточникДоступныхНастроекКомпоновкиДанных(АдресХранилищаСКД);
	
	КомпоновщикНастроек.Инициализировать(ИсточникНастроек);
	КомпоновщикНастроек.ЗагрузитьНастройки(СКД.НастройкиПоУмолчанию);
	
	// Установка параметров.
	бит_ОтчетыБФКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "НачалоПериода", НачалоПериода);
	бит_ОтчетыБФКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "КонецПериода", КонецПериода);
	бит_ОтчетыБФКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "КонецПериодаГраница", КонецПериодаГраница);
	бит_ОтчетыБФКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "Периодичность", Периодичность);
	бит_ОтчетыБФКлиентСервер.УстановитьПараметр(КомпоновщикНастроек, "БазоваяВалюта", ЗначениеНастроекПовтИсп.БазоваяВалютаПоУмолчанию());
	
	КомпоновщикНастроек.ЗагрузитьПользовательскиеНастройки(ПользовательскиеНастройки);
	КомпоновщикНастроек.Восстановить();
	
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СКД, КомпоновщикНастроек.ПолучитьНастройки(),,,
												  Тип("ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений"));
												  
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки);
	
	// Дерево для вывода на форму.
	Результат = Новый ДеревоЗначений;
	
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
	ПроцессорВывода.УстановитьОбъект(Результат);
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);
			
	Возврат Результат;
	
КонецФункции

Процедура ЗаполнитьБанковскиеСчетаИПериоды(БанковскиеСчета, Периоды, Строки)

	Для каждого Строка Из Строки Цикл
		Если Строка.БанковскийСчет <> Неопределено Тогда
			НоваяСтрока = БанковскиеСчета.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		КонецЕсли;  
		Если ЗначениеЗаполнено(Строка.Период) Тогда
			НоваяСтрока = Периоды.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
		КонецЕсли; 
		ЗаполнитьБанковскиеСчетаИПериоды(БанковскиеСчета, Периоды, Строка.Строки);
	КонецЦикла;  

КонецПроцедуры

Процедура ЗаполнитьКолонкиПериодов(КолонкиПериодов, ПериодыКомпоновки, ДанныеОбъекта)
	
	НачалоПериода			 = ДанныеОбъекта.НачалоПериода;  
	КонецПериода			 = ДанныеОбъекта.КонецПериода;  
	ОперативныйДень			 = ДанныеОбъекта.ОперативныйДень;  
	РежимОтображенияПериодов = ДанныеОбъекта.РежимОтображенияПериодов; 						
	
	ПериодыКомпоновки.Свернуть("Период");
	ПериодыКомпоновки.Сортировать("Период Возр");
	Если ПериодыКомпоновки.Количество() > 1000 Тогда
		ПериодыКомпоновки.Индексы.Добавить("Период");
	КонецЕсли; 

	ПоказатьВсе = (ВРег(РежимОтображенияПериодов) = ВРег("Все"));
	
	ТекДата = НачалоПериода;
	Пока ТекДата <= КонецПериода Цикл
		Если ПоказатьВсе Тогда
			// Показываем все периоды.
			Пометка = Истина;
		Иначе
			Если ТекДата = ОперативныйДень Тогда
				// Оперативный день покажем всегда.
				Пометка = Истина;
			ИначеЕсли ПериодыКомпоновки.Найти(ТекДата, "Период") = Неопределено Тогда
				// Скрываем периоды без оборотов.
				Пометка = Ложь;
			Иначе
				// Выводим период.
				Пометка = Истина;	
			КонецЕсли; 
		КонецЕсли;
		
		КолонкиПериодов.Добавить(ТекДата, ИмяКолонкиПериод("П",ТекДата), Пометка);
		ТекДата = КонецДня(ТекДата) + 1;
	КонецЦикла; 
		
	Если КолонкиПериодов.Количество() > 0 Тогда
		// Для вывода остатков на конец
		ПраваяГраница = НачалоДня(КолонкиПериодов[КолонкиПериодов.Количество() - 1].Значение + 86400);
		КолонкиПериодов.Добавить(ПраваяГраница, ИмяКолонкиПериод("П", ПраваяГраница), Истина);
		
		// Для вывода остатков на начало.
		// Колонка на начало периода всегда скрыта.
		ЛеваяГраница = НачалоДня(КолонкиПериодов[0].Значение - 1);
		КолонкиПериодов.Вставить(0, ЛеваяГраница, ИмяКолонкиПериод("П", ЛеваяГраница), Ложь);
	КонецЕсли; 
	
КонецПроцедуры

Функция ДанныеСчетов(БанковскиеСчета, ДанныеОбъекта, КолонкиПериодов)
	
	НачалоПериода 		   = ДанныеОбъекта.НачалоПериода;
	КонецПериода		   = ДанныеОбъекта.КонецПериода;
	РежимОстатков 		   = ДанныеОбъекта.РежимОстатков;
	РежимОтображенияСчетов = ДанныеОбъекта.РежимОтображенияСчетов;
	
	БанковскиеСчета.Свернуть("БанковскийСчет", "Сумма");
	Если ВРег(РежимОтображенияСчетов) = ВРег("НеПустые") Тогда
		Индекс = БанковскиеСчета.Количество() - 1;
		Пока Индекс >= 0 Цикл
			СтрокаТаблицы = БанковскиеСчета.Получить(Индекс); 
			Если СтрокаТаблицы.Сумма = 0 Тогда
				БанковскиеСчета.Удалить(Индекс); 
			КонецЕсли; 
			Индекс = Индекс - 1;
		КонецЦикла;
	КонецЕсли;

	ТекущийДень  		= НачалоДня(ТекущаяДатаСеанса());
	ДанныеСчетов		= Новый Соответствие;
	ГраницаКон 			= Новый Граница(КонецДня(КонецПериода) + 1, ВидГраницы.Включая);	
	ГраницаКонецПериода = Новый Граница(КонецДня(КонецПериода) + 86400, ВидГраницы.Включая);	
	
	// Сформируем сетку дат.
	ТаблицаДат = Новый ТаблицаЗначений;
	ТаблицаДат.Колонки.Добавить("Период",Новый ОписаниеТипов("Дата"));
	Для каждого Элемент Из КолонкиПериодов Цикл
		НоваяСтрока = ТаблицаДат.Добавить();
		НоваяСтрока.Период = Элемент.Значение;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", 		 НачалоПериода);
	Запрос.УстановитьПараметр("НачалоПериодаСдвиг",  НачалоДня(НачалоПериода-1));	
	Запрос.УстановитьПараметр("КонецПериода",		 КонецДня(КонецПериода) + 86400);
	Запрос.УстановитьПараметр("ГраницаКон", 		 ГраницаКон);
	Запрос.УстановитьПараметр("ГраницаКонецПериода", ГраницаКонецПериода);
	Запрос.УстановитьПараметр("БанковскиеСчета", 	 БанковскиеСчета);
	Запрос.УстановитьПараметр("ТаблицаДат",			 ТаблицаДат);
	
	ТекстБанковскиеСчета = ТекстЗапросаВременнаяТаблицаБанковскиеСчета();
	ТекстМНО 			 = ТекстЗапросаМинимальныйНеснижаемыйОстаток();

	Если ДанныеОбъекта.РежимОстатков = Перечисления.бит_кзн_РежимОтображенияОстатковДС.ДанныеРегУчета Тогда
		ТекстОстаткиОбороты = ТекстЗапросаОстаткиДенежныхСредствПоДаннымБухучета();
	ИначеЕсли ДанныеОбъекта.РежимОстатков = Перечисления.бит_кзн_РежимОтображенияОстатковДС.УправленческаяВыписка Тогда			   
		ТекстОстаткиОбороты = ТекстЗапросаОстаткиИзУправленческойВыписки();
	КонецЕсли;	
	
	ТекстОстатки = ТекстЗапросаМинимальныйНеснижаемыйОстатокИтоги();
				   
	ТекстыЗапросовПакета = Новый Массив;
	ТекстыЗапросовПакета.Добавить(ТекстБанковскиеСчета);
	ТекстыЗапросовПакета.Добавить(ТекстМНО);
	ТекстыЗапросовПакета.Добавить(ТекстОстаткиОбороты);
	ТекстыЗапросовПакета.Добавить(ТекстОстатки);

	Запрос.Текст = СтрСоединить(ТекстыЗапросовПакета, Символы.ПС);
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Результат = Запрос.Выполнить();
	
	ВыборкаОрганизация = Результат.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаОрганизация.Следующий() Цикл
		
		ВыборкаВалюта = ВыборкаОрганизация.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ВыборкаВалюта.Следующий() Цикл
			
			ВыборкаСчет = ВыборкаВалюта.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			
			Пока ВыборкаСчет.Следующий() Цикл
				
				СтрПериоды = Новый Структура;
				
				ВыборкаПериод = ВыборкаСчет.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам,"Период","Все");
				ОстатокОперДень = 0;
				
				Пока ВыборкаПериод.Следующий() Цикл
					
					Если НЕ КолонкиПериодов.НайтиПоЗначению(ВыборкаПериод.Период) = Неопределено Тогда
						
						ИмяПериода = ИмяКолонкиПериод("П",ВыборкаПериод.Период);
						
						//СуммаОстаток = ?(ВыборкаПериод.Валюта = ВалютаРегл,ВыборкаПериод.СуммаОстаток,ВыборкаПериод.ВалСуммаОстаток);
						СуммаОстаток = ?(ЗначениеЗаполнено(ВыборкаПериод.СуммаОстаток), ВыборкаПериод.СуммаОстаток, 0); 
						
						Если ВыборкаПериод.Период >= ТекущийДень Тогда
							
							Если ВыборкаПериод.Период = НачалоДня(ТекущийДень + 86400) Тогда
								 // остаток опер. дня необходимо показать с учетом движений, которые были отражены в опер. дне
								 ОстатокОперДень    = СуммаОстаток;
								 ИмяПериодаОперДень = ИмяКолонкиПериод("П", ТекущийДень);
								 Если СтрПериоды.Свойство(ИмяПериодаОперДень) Тогда
								 	СтрПериоды[ИмяПериодаОперДень].СуммаОстаток = ОстатокОперДень;
								 КонецЕсли; 
							КонецЕсли; 
							
							Если ОстатокОперДень = 0 Тогда
								ОстатокОперДень = СуммаОстаток;
							КонецЕсли; 
							СуммаОстаток = ОстатокОперДень;
						Иначе	
							СуммаОстаток = СуммаОстаток;
						КонецЕсли; 
						
						СуммаМНО = ?(ЗначениеЗаполнено(ВыборкаПериод.СуммаМНО),ВыборкаПериод.СуммаМНО,0);
						ДоступныеСредства = СуммаОстаток - СуммаМНО;
						
						СтрСуммы = Новый Структура("СуммаОстаток,СуммаМНО, ДоступныеСредства", СуммаОстаток, СуммаМНО, ДоступныеСредства);
						СтрПериоды.Вставить(ИмяПериода,СтрСуммы);
					КонецЕсли; 
				КонецЦикла;
				
				Ключ = КлючДанныхСчета(ВыборкаСчет.ОрганизацияКод, ВыборкаСчет.БанковскийСчет, ВыборкаСчет.ВалютаКод);
				ДанныеСчетов.Вставить(Ключ, СтрПериоды);
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Возврат ДанныеСчетов;
	
КонецФункции

Функция ТекстЗапросаВременнаяТаблицаБанковскиеСчета()
		
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	БанковскиеСчета.БанковскийСчет КАК БанковскийСчет
	|ПОМЕСТИТЬ ВТ_БанковскиеСчета
	|ИЗ
	|	&БанковскиеСчета КАК БанковскиеСчета";
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();

	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаМинимальныйНеснижаемыйОстаток()
		
	ТекстЗапроса =
	"ВЫБРАТЬ
	|	ТаблицаДат.Период КАК Период
	|ПОМЕСТИТЬ ТаблицаДат
	|ИЗ
	|	&ТаблицаДат КАК ТаблицаДат
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МНО.БанковскийСчет КАК БанковскийСчет,
	|	ТаблицаДат.Период КАК СеткаПериод,
	|	МАКСИМУМ(МНО.Период) КАК Период,
	|	МНО.Организация КАК Организация,
	|	МНО.Валюта КАК Валюта,
	|	МНО.Организация.Наименование КАК ОрганизацияКод,
	|	МНО.Валюта.Код КАК ВалютаКод
	|ПОМЕСТИТЬ ТаблицаДатМНО
	|ИЗ
	|	ТаблицаДат КАК ТаблицаДат
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_НеснижаемыеОстатки КАК МНО
	|		ПО ТаблицаДат.Период >= МНО.Период
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_БанковскиеСчета КАК ВТ_БанковскиеСчета
	|		ПО (МНО.БанковскийСчет = ВТ_БанковскиеСчета.БанковскийСчет)
	|			И (ВТ_БанковскиеСчета.БанковскийСчет <> ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка))
	|ГДЕ
	|	МНО.Период <= &КонецПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	МНО.БанковскийСчет,
	|	ТаблицаДат.Период,
	|	МНО.Организация,
	|	МНО.Валюта,
	|	МНО.Организация.Наименование,
	|	МНО.Валюта.Код
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	МНО.БанковскийСчет,
	|	ТаблицаДат.Период,
	|	МАКСИМУМ(МНО.Период),
	|	МНО.Организация,
	|	МНО.Валюта,
	|	МНО.Организация.Наименование,
	|	МНО.Валюта.Код
	|ИЗ
	|	ТаблицаДат КАК ТаблицаДат
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.бит_НеснижаемыеОстатки КАК МНО
	|		ПО ТаблицаДат.Период >= МНО.Период
	|			И (МНО.БанковскийСчет = ЗНАЧЕНИЕ(Справочник.БанковскиеСчетаОрганизаций.ПустаяСсылка))
	|ГДЕ
	|	МНО.Период <= &КонецПериода
	|
	|СГРУППИРОВАТЬ ПО
	|	МНО.БанковскийСчет,
	|	ТаблицаДат.Период,
	|	МНО.Организация,
	|	МНО.Валюта,
	|	МНО.Организация.Наименование,
	|	МНО.Валюта.Код
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДатМНО.БанковскийСчет КАК БанковскийСчет,
	|	ТаблицаДатМНО.СеткаПериод КАК СеткаПериод,
	|	ВЫБОР
	|		КОГДА ТаблицаДатМНО.СеткаПериод <= МНО.ДатаОкончания
	|				ИЛИ МНО.ДатаОкончания = ДАТАВРЕМЯ(1, 1, 1)
	|			ТОГДА ЕСТЬNULL(МНО.Сумма, 0)
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК СуммаОстаток,
	|	МНО.ДатаОкончания КАК ДатаОкончания,
	|	ТаблицаДатМНО.Организация КАК Организация,
	|	ТаблицаДатМНО.Валюта КАК Валюта,
	|	ТаблицаДатМНО.ОрганизацияКод КАК ОрганизацияКод,
	|	ТаблицаДатМНО.ВалютаКод КАК ВалютаКод
	|ПОМЕСТИТЬ МНО
	|ИЗ
	|	ТаблицаДатМНО КАК ТаблицаДатМНО
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.бит_НеснижаемыеОстатки КАК МНО
	|		ПО ТаблицаДатМНО.БанковскийСчет = МНО.БанковскийСчет
	|			И ТаблицаДатМНО.Период = МНО.Период
	|			И ТаблицаДатМНО.Организация = МНО.Организация
	|			И ТаблицаДатМНО.Валюта = МНО.Валюта";
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();

	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаОстаткиДенежныхСредствПоДаннымБухучета()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДОБАВИТЬКДАТЕ(БезналичныеОстаткиИОбороты.Период, ДЕНЬ, 1) КАК Период,
	|	БезналичныеОстаткиИОбороты.Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Перечисление.бит_ВидыДенежныхСредств.Безналичные) КАК ВидДенежныхСредств,
	|	БезналичныеОстаткиИОбороты.БанковскийСчет КАК БанковскийСчет,
	|	Валюты.Ссылка КАК Валюта,
	|	СУММА(ЕСТЬNULL(БезналичныеОстаткиИОбороты.СуммаКонечныйОстаток, 0)) КАК СуммаОстаток,
	|	0 КАК СуммаМНО,
	|	Валюты.Код КАК ВалютаКод,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(БезналичныеОстаткиИОбороты.Организация) КАК ОрганизацияКод
	|ПОМЕСТИТЬ ТаблицаОстаткиПредв
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваБезналичные.ОстаткиИОбороты(
	|			&НачалоПериодаСдвиг,
	|			&ГраницаКон,
	|			День,
	|			,
	|			БанковскийСчет В
	|				(ВЫБРАТЬ
	|					ВТ_БанковскиеСчета.БанковскийСчет КАК БанковскийСчет
	|				ИЗ
	|					ВТ_БанковскиеСчета КАК ВТ_БанковскиеСчета)) КАК БезналичныеОстаткиИОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	|		ПО БезналичныеОстаткиИОбороты.БанковскийСчет.ВалютаДенежныхСредств = Валюты.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ДОБАВИТЬКДАТЕ(БезналичныеОстаткиИОбороты.Период, ДЕНЬ, 1),
	|	БезналичныеОстаткиИОбороты.Организация,
	|	БезналичныеОстаткиИОбороты.БанковскийСчет,
	|	Валюты.Ссылка,
	|	Валюты.Код
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ДОБАВИТЬКДАТЕ(НаличныеОстаткиИОбороты.Период, ДЕНЬ, 1),
	|	НаличныеОстаткиИОбороты.Организация,
	|	ЗНАЧЕНИЕ(Перечисление.бит_ВидыДенежныхСредств.Наличные),
	|	НаличныеОстаткиИОбороты.Касса,
	|	Валюты.Ссылка,
	|	СУММА(ЕСТЬNULL(НаличныеОстаткиИОбороты.СуммаКонечныйОстаток, 0)),
	|	0,
	|	Валюты.Код,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(НаличныеОстаткиИОбороты.Организация)
	|ИЗ
	|	РегистрНакопления.ДенежныеСредстваНаличные.ОстаткиИОбороты(
	|			&НачалоПериодаСдвиг,
	|			&ГраницаКон,
	|			День,
	|			,
	|			Касса В
	|				(ВЫБРАТЬ
	|					ВТ_БанковскиеСчета.БанковскийСчет КАК БанковскийСчет
	|				ИЗ
	|					ВТ_БанковскиеСчета КАК ВТ_БанковскиеСчета)) КАК НаличныеОстаткиИОбороты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	|		ПО НаличныеОстаткиИОбороты.Касса.ВалютаДенежныхСредств = Валюты.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	ДОБАВИТЬКДАТЕ(НаличныеОстаткиИОбороты.Период, ДЕНЬ, 1),
	|	НаличныеОстаткиИОбороты.Организация,
	|	НаличныеОстаткиИОбороты.Касса,
	|	Валюты.Ссылка";
	
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();

	Возврат ТекстЗапроса;

КонецФункции

Функция ТекстЗапросаОстаткиИзУправленческойВыписки()
	
	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ДОБАВИТЬКДАТЕ(БезналичныеОстаткиИОбороты.Период, ДЕНЬ, 1) КАК Период,
	|	БезналичныеОстаткиИОбороты.Организация КАК Организация,
	|	БезналичныеОстаткиИОбороты.БанковскийСчет КАК БанковскийСчет,
	|	СУММА(ЕСТЬNULL(БезналичныеОстаткиИОбороты.СуммаКонечныйОстаток, 0)) КАК СуммаОстаток,
	|	БезналичныеОстаткиИОбороты.ВидДенежныхСредств КАК ВидДенежныхСредств,
	|	БезналичныеОстаткиИОбороты.Валюта КАК Валюта,
	|	0 КАК СуммаМНО,
	|	Валюты.Код КАК ВалютаКод,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(БезналичныеОстаткиИОбороты.Организация) КАК ОрганизацияКод
	|ПОМЕСТИТЬ ТаблицаОстаткиПредв
	|ИЗ
	|	ВТ_БанковскиеСчета КАК ВТ_БанковскиеСчета
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.бит_СведенияОбОстаткахДенежныхСредств.ОстаткиИОбороты(
	|				&НачалоПериодаСдвиг,
	|				&ГраницаКонецПериода,
	|				День,
	|				,
	|				БанковскийСчет В
	|					(ВЫБРАТЬ
	|						ВТ_БанковскиеСчета.БанковскийСчет
	|					ИЗ
	|						ВТ_БанковскиеСчета КАК ВТ_БанковскиеСчета)) КАК БезналичныеОстаткиИОбороты
	|			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	|			ПО БезналичныеОстаткиИОбороты.Валюта = Валюты.Ссылка
	|		ПО ВТ_БанковскиеСчета.БанковскийСчет = БезналичныеОстаткиИОбороты.БанковскийСчет
	|
	|СГРУППИРОВАТЬ ПО
	|	БезналичныеОстаткиИОбороты.Организация,
	|	БезналичныеОстаткиИОбороты.БанковскийСчет,
	|	ДОБАВИТЬКДАТЕ(БезналичныеОстаткиИОбороты.Период, ДЕНЬ, 1),
	|	БезналичныеОстаткиИОбороты.Валюта,
	|	БезналичныеОстаткиИОбороты.ВидДенежныхСредств,
	|	Валюты.Код";

	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();

	Возврат ТекстЗапроса;
	
КонецФункции

Функция ТекстЗапросаМинимальныйНеснижаемыйОстатокИтоги()

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	ТаблицаДат.Период КАК ПериодСетка,
	|	ТаблицаОстаткиПредв.Организация КАК Организация,
	|	ТаблицаОстаткиПредв.БанковскийСчет КАК БанковскийСчет,
	|	ТаблицаОстаткиПредв.Валюта КАК Валюта,
	|	МАКСИМУМ(ТаблицаОстаткиПредв.Период) КАК Период,
	|	ТаблицаОстаткиПредв.ВидДенежныхСредств КАК ВидДенежныхСредств
	|ПОМЕСТИТЬ ТаблицаДатОстатки
	|ИЗ
	|	ТаблицаДат КАК ТаблицаДат
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОстаткиПредв КАК ТаблицаОстаткиПредв
	|		ПО ТаблицаДат.Период >= ТаблицаОстаткиПредв.Период
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаДат.Период,
	|	ТаблицаОстаткиПредв.Организация,
	|	ТаблицаОстаткиПредв.БанковскийСчет,
	|	ТаблицаОстаткиПредв.Валюта,
	|	ТаблицаОстаткиПредв.ВидДенежныхСредств
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДатОстатки.Организация КАК Организация,
	|	ТаблицаДатОстатки.БанковскийСчет КАК БанковскийСчет,
	|	ТаблицаДатОстатки.Валюта КАК Валюта,
	|	ЕСТЬNULL(ТаблицаОстаткиПредв.СуммаОстаток, 0) КАК СуммаОстаток,
	|	ТаблицаДатОстатки.ПериодСетка КАК Период
	|ПОМЕСТИТЬ ТаблицаОстатки
	|ИЗ
	|	ТаблицаДатОстатки КАК ТаблицаДатОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОстаткиПредв КАК ТаблицаОстаткиПредв
	|		ПО ТаблицаДатОстатки.Организация = ТаблицаОстаткиПредв.Организация
	|			И ТаблицаДатОстатки.БанковскийСчет = ТаблицаОстаткиПредв.БанковскийСчет
	|			И ТаблицаДатОстатки.Валюта = ТаблицаОстаткиПредв.Валюта
	|			И ТаблицаДатОстатки.Период = ТаблицаОстаткиПредв.Период
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МНО.Организация КАК Организация,
	|	МНО.Валюта КАК Валюта,
	|	СУММА(ЕСТЬNULL(ТаблицаОстатки.СуммаОстаток, 0)) КАК СуммаОстаток,
	|	СУММА(МНО.СуммаОстаток) КАК СуммаМНО,
	|	МНО.СеткаПериод КАК Период,
	|	МНО.БанковскийСчет КАК БанковскийСчет,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(МНО.Организация) КАК ОрганизацияКод,
	|	Валюты.Код КАК ВалютаКод
	|ИЗ
	|	МНО КАК МНО
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТаблицаОстатки КАК ТаблицаОстатки
	|		ПО (ТаблицаОстатки.Период = МНО.СеткаПериод)
	|			И (ТаблицаОстатки.Организация = МНО.Организация)
	|			И (ТаблицаОстатки.Валюта = МНО.Валюта)
	|			И (ТаблицаОстатки.БанковскийСчет = МНО.БанковскийСчет)
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	|		ПО МНО.Валюта = Валюты.Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	МНО.Валюта,
	|	МНО.СеткаПериод,
	|	МНО.БанковскийСчет,
	|	МНО.Организация,
	|	Валюты.Код
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТаблицаОстатки.Организация,
	|	ТаблицаОстатки.Валюта,
	|	СУММА(ТаблицаОстатки.СуммаОстаток),
	|	0,
	|	ТаблицаОстатки.Период,
	|	ТаблицаОстатки.БанковскийСчет,
	|	ПРЕДСТАВЛЕНИЕССЫЛКИ(ТаблицаОстатки.Организация),
	|	Валюты.Код
	|ИЗ
	|	ТаблицаОстатки КАК ТаблицаОстатки
	|		ЛЕВОЕ СОЕДИНЕНИЕ МНО КАК МНО
	|		ПО ТаблицаОстатки.Период = МНО.СеткаПериод
	|			И ТаблицаОстатки.Организация = МНО.Организация
	|			И ТаблицаОстатки.Валюта = МНО.Валюта
	|			И ТаблицаОстатки.БанковскийСчет = МНО.БанковскийСчет
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Валюты КАК Валюты
	|		ПО ТаблицаОстатки.Валюта = Валюты.Ссылка
	|ГДЕ
	|	МНО.Организация ЕСТЬ NULL
	|
	|СГРУППИРОВАТЬ ПО
	|	ТаблицаОстатки.Организация,
	|	ТаблицаОстатки.Валюта,
	|	ТаблицаОстатки.Период,
	|	ТаблицаОстатки.БанковскийСчет,
	|	Валюты.Код
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период
	|ИТОГИ
	|	СУММА(СуммаОстаток),
	|	СУММА(СуммаМНО),
	|	МАКСИМУМ(ВалютаКод)
	|ПО
	|	Организация,
	|	Валюта,
	|	БанковскийСчет,
	|	Период
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	ТекстЗапроса = ТекстЗапроса + ОбщегоНазначения.РазделительПакетаЗапросов();

	Возврат ТекстЗапроса;

КонецФункции

Процедура ДобавитьКолонкиДерева(ДеревоСчета, КолонкиПериодов)
	
	// Удаляю колонки, связанные с периодами.
	Индекс = ДеревоСчета.Колонки.Количество() - 1;
	Пока Индекс >= 0 Цикл
		Колонка = ДеревоСчета.Колонки.Получить(Индекс); 
		Если СтрНайти(Колонка.Имя, "П_")>0 Тогда
			ДеревоСчета.Колонки.Удалить(Индекс);
		КонецЕсли;
		Индекс = Индекс - 1;
	КонецЦикла;
	
	Если КолонкиПериодов.Количество() = 0 Тогда
		// Вообще нет данных - ничего не делаем
		Возврат;
	КонецЕсли;	
	
	// Добавим реквизиты и колонки дерева периодов
	// создадим колонки периодов.
	ПервыйПериод    = КолонкиПериодов[0].Значение;
	ПоследнийПериод = КолонкиПериодов[КолонкиПериодов.Количество() - 1].Значение;	
	ОписаниеЧисло   = Новый ОписаниеТипов("Число",Новый КвалификаторыЧисла(15,2));
	
	// Добавим колонки.
	Для каждого Элемент Из КолонкиПериодов Цикл
		
		ИмяКолонки = Элемент.Представление;
		Значение   = Элемент.Значение;
		
		Если Значение = ПоследнийПериод Тогда
			ЗаголовокКолонки = НСтр("ru = 'На конец периода';en = 'At the end of the period'");
		ИначеЕсли Значение = ПервыйПериод Тогда
			ЗаголовокКолонки = НСтр("ru = 'На начало периода';en = 'At the beginning of the period'");
		Иначе	
			ЗаголовокКолонки = Формат(Значение,"ДЛФ=D");
		КонецЕсли; 
		ДеревоСчета.Колонки.Добавить(ИмяКолонки, ОписаниеЧисло, ЗаголовокКолонки);
	КонецЦикла; 

КонецПроцедуры

Процедура ОбойтиСтрокиДереваСчетов(СтрокаВерх, КоллекцияЭлементовВерх, ЭлементВерх, ДанныеСчетов, Объект, Форма)

	РежимОтображенияСчетов 	 = Объект.РежимОтображенияСчетов;
	ВыводитьПрогнозыПлатежей = Объект.ВыводитьПрогнозыПлатежей;
	
	МаксКолвоДопАналитик   = Форма.МаксКолвоДопАналитик;
	
	// Иерерхия: Организация/ВидДенежныхСредств/БанковскийСчет/ВидДанных/ДокументПланирования
	
	Для каждого СтрокаДерева Из СтрокаВерх.Строки Цикл
		
		Если Форма.МаксУровеньДеревоСчета < СтрокаДерева.Уровень() Тогда
			Форма.МаксУровеньДеревоСчета = СтрокаДерева.Уровень();
		КонецЕсли; 
		
		// Выполним фильтрацию по счетам.
		Если ВРег(Объект.РежимОтображенияСчетов) = ВРег("НеПустые") И СтрокаДерева.Уровень() <=2 Тогда
			Если НЕ ЗначениеЗаполнено(СтрокаДерева.Сумма) Тогда
				Продолжить;
			КонецЕсли;	
		КонецЕсли; 
		
		Если НЕ ЗначениеЗаполнено(СтрокаДерева.Организация) Тогда
			Продолжить;
		КонецЕсли; 
		
		Если НЕ ЗначениеЗаполнено(СтрокаДерева.ВидДанных) И СтрокаДерева.Уровень() = 3 Тогда
			Продолжить;
		КонецЕсли; 
		
		Если НЕ ЗначениеЗаполнено(СтрокаДерева.ДокументПланирования) И СтрокаДерева.Уровень()=4 Тогда
			Продолжить;
		КонецЕсли;
		
		Если СтрокаДерева.Уровень() <=5 Тогда
						
			Если СтрокаДерева.Уровень() = 0 Тогда
				
				НовыйЭлементДерева = ДобавитьСтрокуДереваСчета(КоллекцияЭлементовВерх,СтрокаДерева);				
				
				НовыйЭлементДерева.Измерение = СтрокаДерева.Организация;
				НовыйЭлементДерева.ДоступностьФлажка = Истина;
				НовыйЭлементДерева.ИмяГруппировки = "Организация";
				
			ИначеЕсли СтрокаДерева.Уровень() = 1 Тогда
				
				НовыйЭлементДерева = ДобавитьСтрокуДереваСчета(КоллекцияЭлементовВерх,СтрокаДерева);				
				
				НовыйЭлементДерева.Измерение = СтрокаДерева.ВидДенежныхСредств;
				НовыйЭлементДерева.ДоступностьФлажка = Истина;								
				НовыйЭлементДерева.ИмяГруппировки = "ВидДенежныхСредств";
				
			ИначеЕсли СтрокаДерева.Уровень() = 2 Тогда	
				
				НовыйЭлементДерева = ДобавитьСтрокуДереваСчета(КоллекцияЭлементовВерх,СтрокаДерева);				
				
				НовыйЭлементДерева.Измерение = СтрокаДерева.БанковскийСчет;
				НовыйЭлементДерева.ВалютаДенежныхСредств = СтрокаДерева.ВалютаДенежныхСредств;
				НовыйЭлементДерева.ДоступностьФлажка = ЗначениеЗаполнено(СтрокаДерева.БанковскийСчет);				
				НовыйЭлементДерева.ИмяГруппировки = "БанковскийСчет";
				
				// Заполним остатки по банковским счетам
				Ключ 	= КлючДанныхСчета(СтрокаДерева.ОрганизацияКод, СтрокаДерева.БанковскийСчет, 
							СтрокаДерева.ВалютаДенежныхСредствКод);
				Периоды = ДанныеСчетов[Ключ];
				
				Если ТипЗнч(Периоды) = Тип("Структура") Тогда
					Для каждого КиЗ Из Периоды Цикл
						ТекИмя  = КиЗ.Ключ;
						СтрСумм = КиЗ.Значение;
						НовыйЭлементДерева[ТекИмя] = НовыйЭлементДерева[ТекИмя] + СтрСумм.СуммаОстаток;
					КонецЦикла; 
				КонецЕсли;// Заполним остатки по банковским счетам 
								
			ИначеЕсли СтрокаДерева.Уровень() = 3 Тогда
				
				НовыйЭлементДерева = ДобавитьСтрокуДереваСчета(КоллекцияЭлементовВерх,СтрокаДерева);				
				
				НовыйЭлементДерева.Измерение             = СтрокаДерева.ВидДанных;
				НовыйЭлементДерева.ВалютаДенежныхСредств = ЭлементВерх.ВалютаДенежныхСредств;
				НовыйЭлементДерева.ИмяГруппировки 		 = "ВидДанных";
				
				// Заполнить минимальные неснижаемые остатки.
				Если НовыйЭлементДерева.ВидДанных = Перечисления.бит_ВидыДанныхРабочееМестоКазначея.МНО Тогда
					
					Ключ 	= КлючДанныхСчета(СтрокаДерева.ОрганизацияКод, СтрокаДерева.БанковскийСчет, 
								СтрокаДерева.ВалютаДенежныхСредствКод);
					Периоды = ДанныеСчетов[Ключ];
					
					Если ТипЗнч(Периоды) = Тип("Структура") Тогда
						Для каждого КиЗ Из Периоды Цикл
							ТекИмя  = КиЗ.Ключ;
							СтрСумм = КиЗ.Значение;
							НовыйЭлементДерева[ТекИмя] = НовыйЭлементДерева[ТекИмя] + СтрСумм.СуммаМНО;
						КонецЦикла; 
					КонецЕсли; 
					
				ИначеЕсли НовыйЭлементДерева.ВидДанных = Перечисления.бит_ВидыДанныхРабочееМестоКазначея.Расход 
					      ИЛИ НовыйЭлементДерева.ВидДанных = Перечисления.бит_ВидыДанныхРабочееМестоКазначея.Поступление Тогда
					
					СтрокаБанковскийСчет = НовыйЭлементДерева.Родитель;
					СтрокаДенежныйПоток  = НайтиСтрокуВида(СтрокаБанковскийСчет, Перечисления.бит_ВидыДанныхРабочееМестоКазначея.ДенежныйПоток);
					Если НЕ СтрокаДенежныйПоток = Неопределено Тогда
						 Если НовыйЭлементДерева.ВидДанных = Перечисления.бит_ВидыДанныхРабочееМестоКазначея.Расход Тогда
						 	Знак = - 1;
						 Иначе	
						 	Знак = 1;
						 КонецЕсли;
						СтрокаДенежныйПоток.Сумма 	   = СтрокаДенежныйПоток.Сумма 		+ Знак * НовыйЭлементДерева.Сумма;
						СтрокаДенежныйПоток.СуммаФакт  = СтрокаДенежныйПоток.СуммаФакт  + Знак * НовыйЭлементДерева.СуммаФакт;
						СтрокаДенежныйПоток.Отклонение = СтрокаДенежныйПоток.Отклонение + Знак * НовыйЭлементДерева.Отклонение;
					КонецЕсли; 
					
					Если НовыйЭлементДерева.ВидДанных = Перечисления.бит_ВидыДанныхРабочееМестоКазначея.Расход 
						ИЛИ НовыйЭлементДерева.ВидДанных = Перечисления.бит_ВидыДанныхРабочееМестоКазначея.Поступление Тогда
						// NB Исследовать.
						Если НЕ СтрокаДенежныйПоток = Неопределено Тогда
							НовыйЭлементДерева.ДоступностьФлажка = СтрокаДенежныйПоток.Сумма;
						КонецЕсли;	
					КонецЕсли; 
				КонецЕсли;// заполнить минимальные неснижаемые остатки 
				
			ИначеЕсли СтрокаДерева.Уровень() = 4 Тогда
				
				// Создадим строку с которой будут оплаченные заявки.
				Если СтрокаДерева.Оплачено = Истина Тогда
				
					 СтрокаОплачено = НайтиСтрокуВида(ЭлементВерх,Перечисления.бит_ВидыДанныхРабочееМестоКазначея.Оплата);
					 
					 Если СтрокаОплачено = Неопределено Тогда
						Если СтрокаДерева.Строки.Количество() > 0 Тогда
							// NB Исследовать
							СтрокаОплачено = ДобавитьСтрокуДереваСчета(КоллекцияЭлементовВерх,СтрокаДерева);
							СтрокаОплачено.Измерение        = Перечисления.бит_ВидыДанныхРабочееМестоКазначея.Оплата;
							СтрокаОплачено.ВидДанных        = Перечисления.бит_ВидыДанныхРабочееМестоКазначея.Оплата;
							СтрокаОплачено.ВалютаДенежныхСредств = СтрокаДерева.ВалютаДенежныхСредств;
							СтрокаОплачено.ПлатежнаяПозиция 	 = Документы.бит_кзн_ПлатежнаяПозиция.ПустаяСсылка();
							СтрокаОплачено.Сумма = 0;
							СтрокаОплачено.СуммаФакт = 0;
						Иначе
							Продолжить;	
						КонецЕсли;  
					КонецЕсли; 
					
					КоллекцияОплачено = СтрокаОплачено.Строки;
					
					НовыйЭлементДерева = ДобавитьСтрокуДереваСчета(КоллекцияОплачено,СтрокаДерева);
					СтрокаОплачено.Сумма       = СтрокаОплачено.Сумма + СтрокаДерева.Сумма;
					СтрокаОплачено.СуммаФакт   = СтрокаОплачено.СуммаФакт + СтрокаДерева.СуммаФакт;
					
					НовыйЭлементДерева.Измерение = СтрокаДерева.ДокументПланирования;
					РасширитьДанныеЭлементаДерева(НовыйЭлементДерева, СтрокаДерева, МаксКолвоДопАналитик);
					
				// Прогнозы оформим отдельной веткой в расходе.
				ИначеЕсли СтрокаДерева.ЭтоПрогноз = Истина Тогда
					
					СтрокаПрогноз = НайтиСтрокуВида(ЭлементВерх,Перечисления.бит_ВидыДанныхРабочееМестоКазначея.Прогноз);
					
					Если СтрокаПрогноз = Неопределено Тогда
						// Добавим группу Прогноз
						СтрокаПрогноз = ДобавитьГруппуПрогноз(КоллекцияЭлементовВерх, СтрокаДерева);
					КонецЕсли;
					
					КоллекцияПрогноз = СтрокаПрогноз.Строки;
					
					НовыйЭлементДерева = ДобавитьСтрокуДереваСчета(КоллекцияПрогноз,СтрокаДерева);
					НовыйЭлементДерева.Измерение	= СтрокаДерева.ДокументПланирования;
					НовыйЭлементДерева.Сумма		= СтрокаДерева.Сумма;
					НовыйЭлементДерева.СуммаФакт	= СтрокаДерева.СуммаФакт;
					
					СтрокаПрогноз.Сумма 	= СтрокаПрогноз.Сумма + СтрокаДерева.Сумма;
					СтрокаПрогноз.СуммаФакт = СтрокаПрогноз.СуммаФакт + СтрокаДерева.СуммаФакт;
										
				ИначеЕсли СтрокаДерева.КоличествоПозиций > 1 Тогда
					
					Если СтрокаДерева.Строки.Количество() > 0 Тогда
						НовыйЭлементДерева = КоллекцияЭлементовВерх.Добавить();
						НовыйЭлементДерева.Измерение 					  = СтрокаДерева.ДокументПланирования;
						НовыйЭлементДерева.ИмяГруппировки 				  = "ДокументПланирования";
						НовыйЭлементДерева.ИмяДатаПлатежаКрайняя 		  = ИмяКолонкиПериод("П", '20391231');
						НовыйЭлементДерева.ЭтоОстатокПоНеоплаченнойЗаявке = СтрокаДерева.ЭтоОстатокПоНеоплаченнойЗаявке;
					Иначе
						Продолжить;
					КонецЕсли; 
				Иначе 
					
					Если СтрокаДерева.Строки.Количество() > 0 Тогда
						НовыйЭлементДерева = ДобавитьСтрокуДереваСчета(КоллекцияЭлементовВерх,СтрокаДерева);
						НовыйЭлементДерева.Измерение = СтрокаДерева.ДокументПланирования;
						РасширитьДанныеЭлементаДерева(НовыйЭлементДерева, СтрокаДерева, МаксКолвоДопАналитик);
					Иначе 
						Продолжить;
					КонецЕсли; 
				КонецЕсли; 
				
				НовыйЭлементДерева.ИмяГруппировки = "ДокументПланирования";
				
			ИначеЕсли СтрокаДерева.Уровень() = 5 И СтрокаДерева.КоличествоПозиций > 1 Тогда
				
				НовыйЭлементДерева = ДобавитьСтрокуДереваСчета(КоллекцияЭлементовВерх,СтрокаДерева);
				НовыйЭлементДерева.Измерение 	 = СтрокаДерева.ПлатежнаяПозиция;
				НовыйЭлементДерева.СтатусПозиции = СтрокаДерева.СтатусПозиции;
				РасширитьДанныеЭлементаДерева(НовыйЭлементДерева, СтрокаДерева, МаксКолвоДопАналитик);
				
				Если НовыйЭлементДерева.Оплачено Тогда
					НовыйЭлементДерева.ИмяДатаПлатежаКрайняя = ИмяКолонкиПериод("П", '20391231');
				Иначе	
					НовыйЭлементДерева.ДатаПлатежаКрайняя = СтрокаДерева.ПлатежнаяПозиция.ДатаПланКрайняя;
				КонецЕсли;
					
				Если ЗначениеЗаполнено(НовыйЭлементДерева.ДатаПлатежаКрайняя) Тогда
					НовыйЭлементДерева.ИмяДатаПлатежаКрайняя = ИмяКолонкиПериод("П",НовыйЭлементДерева.ДатаПлатежаКрайняя);
				КонецЕсли;
				
				СтрокаЗаявка = НовыйЭлементДерева.Родитель;
				Если ЗначениеЗаполнено(СтрокаДерева.ПлатежнаяПозиция)
					И НЕ ЗначениеЗаполнено(НовыйЭлементДерева.ВалютаДенежныхСредств) Тогда 	
					СписокРеквизитов		= "БанковскийСчет, ОбъектРасчетов, ВалютаДокумента";
					РеквизитыПозиции 		= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаДерева.ПлатежнаяПозиция, 
												СписокРеквизитов);
					ВалютыРассчетов = бит_Казначейство.ВалютыРассчетов(РеквизитыПозиции.ОбъектРасчетов, РеквизитыПозиции.БанковскийСчет, 
												РеквизитыПозиции.ВалютаДокумента);
					НовыйЭлементДерева.ВалютаДенежныхСредств = ВалютыРассчетов.ВалютаОплаты;							
				Иначе 
					СтрокаЗаявка.ВалютаДенежныхСредств = СтрокаДерева.ВалютаДенежныхСредств;
				КонецЕсли;	

				СтрокаЗаявка.ВидПлана = СтрокаДерева.ВидПлана;
				Если НЕ СтрокаДерева.Оплачено Тогда
					// Общая сумма позиций.
					СтрокаЗаявка = НовыйЭлементДерева.Родитель;
					СтрокаЗаявка.Сумма     = СтрокаЗаявка.Сумма+СтрокаДерева.Сумма;
					СтрокаЗаявка.СуммаФакт = СтрокаЗаявка.СуммаФакт+СтрокаДерева.СуммаФакт;
				КонецЕсли; 
				
				ВОплату = ДокументВЭтомСтатусеМожетБытьОплачен(СтрокаДерева, НовыйЭлементДерева);
				
				Если ВОплату Тогда 
					ЭлементРодитель = НовыйЭлементДерева.Родитель;
					ЭлементРодитель.ДоступностьФлажка  = Истина;
					ЭлементРодитель.СостояниеДокумента = НовыйЭлементДерева.СостояниеДокумента;
				КонецЕсли; 
								
			ИначеЕсли СтрокаДерева.Уровень() = 5 И СтрокаДерева.КоличествоПозиций = 1 Тогда
				
				НовыйЭлементДерева = ЭлементВерх;
				
				Если НовыйЭлементДерева.Оплачено Тогда
					НовыйЭлементДерева.ИмяДатаПлатежаКрайняя = ИмяКолонкиПериод("П", '20391231');
				Иначе	
					НовыйЭлементДерева.ДатаПлатежаКрайняя = СтрокаДерева.ПлатежнаяПозиция.ДатаПланКрайняя;
				КонецЕсли; 
				
				НовыйЭлементДерева.ПлатежнаяПозиция = СтрокаДерева.ПлатежнаяПозиция;
				НовыйЭлементДерева.ДатаПлан = СтрокаДерева.ДатаПлан;
				НовыйЭлементДерева.СтатусПозиции = СтрокаДерева.СтатусПозиции;
				
				РасширитьДанныеЭлементаДерева(НовыйЭлементДерева, СтрокаДерева, МаксКолвоДопАналитик);
				
				Если ЗначениеЗаполнено(СтрокаДерева.ПлатежнаяПозиция)
					И НЕ ЗначениеЗаполнено(НовыйЭлементДерева.ВалютаДенежныхСредств) Тогда 	
					СписокРеквизитов		= "БанковскийСчет, ОбъектРасчетов, ВалютаДокумента";
					РеквизитыПозиции 		= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаДерева.ПлатежнаяПозиция, 
												СписокРеквизитов);
					ВалютыРассчетов = бит_Казначейство.ВалютыРассчетов(РеквизитыПозиции.ОбъектРасчетов, РеквизитыПозиции.БанковскийСчет, 
												РеквизитыПозиции.ВалютаДокумента);
					НовыйЭлементДерева.ВалютаДенежныхСредств = ВалютыРассчетов.ВалютаОплаты;
				КонецЕсли; 
				
				Если ЗначениеЗаполнено(НовыйЭлементДерева.ДатаПлатежаКрайняя) Тогда
					НовыйЭлементДерева.ИмяДатаПлатежаКрайняя = ИмяКолонкиПериод("П",НовыйЭлементДерева.ДатаПлатежаКрайняя);
				КонецЕсли;
				
				ВОплату = ДокументВЭтомСтатусеМожетБытьОплачен(СтрокаДерева, НовыйЭлементДерева);
			КонецЕсли; 
			
			КоллекцияЭлементов = НовыйЭлементДерева.Строки;
			
			ОбойтиСтрокиДереваСчетов(СтрокаДерева, КоллекцияЭлементов, НовыйЭлементДерева, ДанныеСчетов, Объект, Форма);
			
		Иначе 	
		   
			Если СтрокаДерева.Уровень() = 6 Тогда
				ИмяКолонки = ИмяКолонкиПериод("П",СтрокаДерева.Период);
				Если НЕ ЭлементВерх = Неопределено
					И ЗначениеЗаполнено(СтрокаДерева.Сумма)
					И ЗначениеЗаполнено(СтрокаДерева.Период) 
					И НЕ (СтрокаДерева.ЕстьПлатежныйДокумент И СтрокаДерева.Оплачено) Тогда 
					
					ВыполнитьИерархическиеРасчеты(ЭлементВерх, ИмяКолонки, СтрокаДерева.Отклонение, Форма);
				КонецЕсли; 
			КонецЕсли; 
		КонецЕсли; 
	КонецЦикла; 

КонецПроцедуры

Функция ДобавитьСтрокуДереваСчета(КоллекцияЭлементовВерх,СтрокаДерева)
	
	НовыйЭлементДерева = КоллекцияЭлементовВерх.Добавить();
	НовыйЭлементДерева.ИмяДатаПлатежаКрайняя = ИмяКолонкиПериод("П", '20391231');
	
	ЗаполнитьЗначенияСвойств(НовыйЭлементДерева, СтрокаДерева, ,"Сумма, СуммаФакт, Отклонение");
	
	Если СтрокаДерева.Уровень() > 2 Тогда
		НовыйЭлементДерева.Сумма       = СтрокаДерева.Сумма;
		НовыйЭлементДерева.СуммаФакт   = СтрокаДерева.СуммаФакт;
		НовыйЭлементДерева.Отклонение  = СтрокаДерева.Отклонение;
	КонецЕсли; 
	
	НовыйЭлементДерева.СостояниеДокумента = -1;
	
	Возврат НовыйЭлементДерева;
	
КонецФункции

Функция НайтиСтрокуВида(СтрокаБанкСчет,ВидДанных)

	СтрокаВидДанных = Неопределено;
	ВидыДанных = СтрокаБанкСчет.Строки;
	Для каждого ТекСтрока  Из ВидыДанных Цикл		
		Если ТекСтрока.ВидДанных = ВидДанных Тогда
		
			СтрокаВидДанных = ТекСтрока;
			Прервать;
			
		КонецЕсли; 		
	КонецЦикла;	

	Возврат СтрокаВидДанных;
	
КонецФункции

Процедура РасширитьДанныеЭлементаДерева(НовыйЭлементДерева, СтрокаДерева, МаксКолвоДопАналитик)

	НовыйЭлементДерева.ПлатежнаяПозиция		 = СтрокаДерева.ПлатежнаяПозиция;
	
	НовыйЭлементДерева.ИмяГруппировки 		 = "ДокументПланирования";
	
	НовыйЭлементДерева.ВалютаДенежныхСредств = СтрокаДерева.ВалютаДенежныхСредств;
	НовыйЭлементДерева.ВидПлана				 = СтрокаДерева.ВидПлана;
	НовыйЭлементДерева.Оплачено              = СтрокаДерева.Оплачено;
	НовыйЭлементДерева.ЕстьПлатежныйДокумент = СтрокаДерева.ЕстьПлатежныйДокумент;
	НовыйЭлементДерева.ЭтоОстатокПоНеоплаченнойЗаявке = СтрокаДерева.ЭтоОстатокПоНеоплаченнойЗаявке;
	
	Если СтрокаДерева.Уровень() = 4 
		И НЕ ЗначениеЗаполнено(СтрокаДерева.ПлатежнаяПозиция)
		И СтрокаДерева.Строки.Количество()>0 Тогда
		
		НовыйЭлементДерева.СтатьяОборотов = СтрокаДерева.Строки[0].СтатьяОборотов;
		НовыйЭлементДерева.ЦФО = СтрокаДерева.Строки[0].ЦФО; 
		
		Для н = 1 По МаксКолвоДопАналитик Цикл
			НовыйЭлементДерева["Аналитика_"+н]  = СтрокаДерева.Строки[0]["Аналитика_"+н];
		КонецЦикла;
	   
	Иначе	
		
		НовыйЭлементДерева.СтатьяОборотов = СтрокаДерева.СтатьяОборотов;
		НовыйЭлементДерева.ЦФО = СтрокаДерева.ЦФО; 
		
		Для н = 1 По МаксКолвоДопАналитик Цикл
			НовыйЭлементДерева["Аналитика_"+н]  = СтрокаДерева["Аналитика_"+н];
		КонецЦикла;
		
	КонецЕсли;	

	НовыйЭлементДерева.СостояниеДокумента = 0;
	
	Если СтрокаДерева.ЕстьРеестр = Истина Тогда
		НовыйЭлементДерева.СостояниеДокумента = 2;
	КонецЕсли;
	
	Если СтрокаДерева.Уровень() = 5 
		ИЛИ СтрокаДерева.Оплачено Тогда
		
		Если СтрокаДерева.ЕстьРеестр = Истина Тогда
			НовыйЭлементДерева.СостояниеДокумента = 2;
		КонецЕсли; 
		
		Если НовыйЭлементДерева.ЕстьПлатежныйДокумент Тогда
			НовыйЭлементДерева.СостояниеДокумента = 1;
			
			Если НовыйЭлементДерева.Оплачено Тогда
				НовыйЭлементДерева.СостояниеДокумента = 3;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

Функция ДобавитьГруппуПрогноз(КоллекцияЭлементовРасход, СтрокаДерева)
	
	СтрокаПрогноз = ДобавитьСтрокуДереваСчета(КоллекцияЭлементовРасход,СтрокаДерева);
	
	// Группа будет располагаться первой в своей ветке.
	ПозицияСтроки = КоллекцияЭлементовРасход.Индекс(СтрокаПрогноз);
	Если НЕ ПозицияСтроки = -1
		И НЕ ПозицияСтроки = 0 Тогда
		КоллекцияЭлементовРасход.Сдвинуть(ПозицияСтроки, -ПозицияСтроки);
	КонецЕсли;
	
	СтрокаПрогноз.Измерение        = Перечисления.бит_ВидыДанныхРабочееМестоКазначея.Прогноз;
	СтрокаПрогноз.ВидДанных        = Перечисления.бит_ВидыДанныхРабочееМестоКазначея.Прогноз;
	СтрокаПрогноз.ВалютаДенежныхСредств = СтрокаДерева.ВалютаДенежныхСредств;
	СтрокаПрогноз.ДокументПланирования  = Документы.бит_кзн_ЗаявкаНаРасходованиеСредств.ПустаяСсылка();
	СтрокаПрогноз.Сумма = 0;
	СтрокаПрогноз.СуммаФакт = 0;
	
	Возврат СтрокаПрогноз;
	
КонецФункции

Функция ДокументВЭтомСтатусеМожетБытьОплачен(СтрокаДерева, НовыйЭлементДерева)

	Статус = СтрокаДерева.СтатусПозиции;
		
	ВОплату = Ложь;
	
	ТипСтатуса = Справочники.бит_СтатусыОбъектов.ТипСтатусаОбъкта(Статус);
	Если ТипСтатуса = Перечисления.бит_ТипыСтатусовОбъектов.Утвержден Тогда
	
		ВОплату = Истина;
	
	КонецЕсли; 

	Если ЗначениеЗаполнено(НовыйЭлементДерева.БанковскийСчет) 
		И ТипЗнч(НовыйЭлементДерева.ПлатежнаяПозиция) = Тип("ДокументСсылка.бит_кзн_ПлатежнаяПозиция")
		И НЕ НовыйЭлементДерева.Оплачено 
		И ВОплату 
		И НЕ НовыйЭлементДерева.ЕстьПлатежныйДокумент
		И НовыйЭлементДерева.ПлатежнаяПозиция.ВидПлана = Перечисления.бит_кзн_ВидыПланов.План Тогда
		 
		НовыйЭлементДерева.ДоступностьФлажка = Истина;
		
	ИначеЕсли ТипЗнч(НовыйЭлементДерева.ПлатежнаяПозиция) = Тип("ДокументСсылка.бит_кзн_ПозицияПоступления")
		И НЕ НовыйЭлементДерева.Оплачено 
		И ВОплату
		И НЕ НовыйЭлементДерева.ЕстьПлатежныйДокумент
		И НовыйЭлементДерева.ПлатежнаяПозиция.ВидПлана = Перечисления.бит_кзн_ВидыПланов.План Тогда
		
		НовыйЭлементДерева.ДоступностьФлажка = Истина;
		
	КонецЕсли; 
	
	Возврат НовыйЭлементДерева.ДоступностьФлажка;
	
КонецФункции

Процедура ВыполнитьИерархическиеРасчеты(СтрокаДокумент, ИмяКолонки, Сумма, Форма)
	
	Если Сумма < 0 Тогда
		Возврат;	
	КонецЕсли;  
	
	КолонкиПериодов = Форма.КолонкиПериодов;
	ТекущийДень 	= НачалоДня(ТекущаяДатаСеанса());
	
	СтрокаДокумент[ИмяКолонки] = Сумма;
	
	Если ВРег(СтрокаДокумент.Родитель.ИмяГруппировки) = ВРег("ВидДанных") Тогда
		СтрокаВидДанных = СтрокаДокумент.Родитель;
	Иначе
		СтрокаРодитель = СтрокаДокумент.Родитель;
		СтрокаРодитель[ИмяКолонки] = СтрокаРодитель[ИмяКолонки] + Сумма;
		СтрокаВидДанных = СтрокаДокумент.Родитель.Родитель;
	КонецЕсли;	
	
	Если СтрокаВидДанных = Неопределено Тогда
		Возврат;
	КонецЕсли; 
		
	// Приращение к виду данных (приходу или расходу).
	СтрокаВидДанных[ИмяКолонки] = СтрокаВидДанных[ИмяКолонки]+Сумма;
	
	Знак = 0;
	
	// В зависимости от вида данных определим знак.
	Если СтрокаВидДанных.ВидДанных = Перечисления.бит_ВидыДанныхРабочееМестоКазначея.Расход
		ИЛИ СтрокаВидДанных.ВидДанных = Перечисления.бит_ВидыДанныхРабочееМестоКазначея.Оплата
		ИЛИ СтрокаВидДанных.ВидДанных = Перечисления.бит_ВидыДанныхРабочееМестоКазначея.Прогноз Тогда
		Знак = -1;
	ИначеЕсли СтрокаВидДанных.ВидДанных = Перечисления.бит_ВидыДанныхРабочееМестоКазначея.Поступление Тогда	
		Знак = 1;
	КонецЕсли; 
	
	Если Знак = 0 Тогда
		Возврат;	
	КонецЕсли;
		
	Если СтрокаВидДанных.ВидДанных = Перечисления.бит_ВидыДанныхРабочееМестоКазначея.Оплата Тогда
		СтрокаРасход = СтрокаВидДанных.Родитель;
		СтрокаРасход[ИмяКолонки] = СтрокаРасход[ИмяКолонки] + Сумма;
		СтрокаБанкСчет = СтрокаРасход.Родитель;
	ИначеЕсли СтрокаВидДанных.ВидДанных = Перечисления.бит_ВидыДанныхРабочееМестоКазначея.Прогноз Тогда
		СтрокаРасход = СтрокаВидДанных.Родитель;
		СтрокаРасход[ИмяКолонки] = СтрокаРасход[ИмяКолонки] + Сумма;
		СтрокаБанкСчет = СтрокаРасход.Родитель;
	Иначе	
		СтрокаБанкСчет = СтрокаВидДанных.Родитель;
	КонецЕсли; 
	
	Если СтрокаБанкСчет = Неопределено Тогда
		Возврат;	
	КонецЕсли;
	
	// Добавим приращение к денежному потоку.
	ВидыДанных = СтрокаБанкСчет.Строки;
	Для каждого СтрокаВидДанных  Из ВидыДанных Цикл
		Если СтрокаВидДанных.ВидДанных = Перечисления.бит_ВидыДанныхРабочееМестоКазначея.ДенежныйПоток Тогда
			СтрокаВидДанных[ИмяКолонки] = СтрокаВидДанных[ИмяКолонки] + Знак * Сумма;
		КонецЕсли; 
	КонецЦикла; // По строкам виды данных.
	
	ИмяОперативныйДень = ИмяКолонкиПериод("П", ТекущийДень);
	
	// Нарастающий итог денежного потока.
	Если ЗначениеЗаполнено(СтрокаВидДанных.БанковскийСчет) И ИмяКолонки >= ИмяОперативныйДень Тогда
		Для каждого Элемент Из КолонкиПериодов Цикл
			ТекИмя = Элемент.Представление;
			Если ТекИмя > ИмяКолонки  Тогда
				// Корректируем на сумму остатка.
				СтрокаБанкСчет[ТекИмя] = СтрокаБанкСчет[ТекИмя] + Знак * Сумма;
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли; 								

КонецПроцедуры

#КонецОбласти // ЗаполнениеОсновнойОбластиРМК

// Процедура создает реестр платежей.
// 
// Параметры:
// Организация - СправочникСсылка.Организации.
// МассивИД    - Массив.
// 
// 
Функция СоздатьРеестрПлатежей(Организация, ДанныеЗаполнения, Провести)
	
	ДокРеестр = Документы.бит_кзн_РеестрПлатежей.СоздатьДокумент();
	ПараметрыЗаполнения = Новый Структура;
	ПараметрыЗаполнения.Вставить("Организация", Организация);
	ПараметрыЗаполнения.Вставить("Ответственный", ДанныеЗаполнения.Ответственный);
	ДокРеестр.Заполнить(ПараметрыЗаполнения);
	ДокРеестр.УстановитьВремя(РежимАвтоВремя.ТекущееИлиПоследним);
	ДокРеестр.Дата = ДанныеЗаполнения.ОперативныйДень;
	
	Для каждого СтрокаТаблицы Из ДанныеЗаполнения.Таблица Цикл
		
		НоваяСтрока = ДокРеестр.ТаблицаПлатежи.Добавить();
		Если ЗначениеЗаполнено(Организация) Тогда
			НоваяСтрока.Организация = Организация;
		Иначе	
			НоваяСтрока.Организация = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТаблицы.ДокументПланирования, "Организация");
		КонецЕсли; 
		РеквизитыПлатежныхПозиций = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(СтрокаТаблицы.ПлатежнаяПозиция, "ВалютаДокумента, СуммаДокумента");

		НоваяСтрока.ЗаявкаПлатежнаяПозиция = СтрокаТаблицы.ДокументПланирования;
		НоваяСтрока.ПлатежнаяПозиция 	   = СтрокаТаблицы.ПлатежнаяПозиция;
		НоваяСтрока.ФормаОплаты      	   = СтрокаТаблицы.ВидДенежныхСредств;

		НоваяСтрока.ВалютаДокумента = РеквизитыПлатежныхПозиций.ВалютаДокумента;
		НоваяСтрока.СуммаДокумента  = РеквизитыПлатежныхПозиций.СуммаДокумента;
		НоваяСтрока.СуммаОстаток    = РеквизитыПлатежныхПозиций.СуммаДокумента;
		
		НоваяСтрока.ВалютаПлатежа = СтрокаТаблицы.ВалютаДенежныхСредств;
		НоваяСтрока.СуммаПлан     = РеквизитыПлатежныхПозиций.СуммаДокумента;
		НоваяСтрока.СуммаКОплате  = РеквизитыПлатежныхПозиций.СуммаДокумента;
		
		ПараметрыВалюты = Новый Структура;
		ПараметрыВалюты.Вставить("Дата"			  , ТекущаяДатаСеанса());
		ПараметрыВалюты.Вставить("ВалютаДокумента", НоваяСтрока.ВалютаПлатежа);
		
		СуммаПлатежа = бит_Казначейство.ПересчитатьСуммуПлатежаПоВалюте(НоваяСтрока.СуммаПлан, НоваяСтрока.ПлатежнаяПозиция, ПараметрыВалюты);
		НоваяСтрока.СуммаПлан 	 = СуммаПлатежа;
		НоваяСтрока.СуммаКОплате = СуммаПлатежа;
	КонецЦикла; 
	
	РеестрПлатежей = Неопределено;
	Если ЗначениеЗаполнено(ДокРеестр.ТаблицаПлатежи) Тогда
		РежимЗаписи = ?(Провести, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись);
		бит_ОбщегоНазначения.ЗаписатьПровестиДокумент(ДокРеестр, РежимЗаписи,, ДанныеЗаполнения.РежимСообщений);
		РеестрПлатежей = ДокРеестр.Ссылка;
	КонецЕсли;
	
	Возврат РеестрПлатежей;
	
КонецФункции 

Функция КлючДанныхСчета(КодОрганизации, МестоХранения, КодВалюты)

	Возврат Строка(КодОрганизации) + "/" + Строка(МестоХранения) + "/"+ Строка(КодВалюты);

КонецФункции

#КонецОбласти

#КонецЕсли
